# Brewfile - 2026 Core Mac baseline
# Run: brew bundle install --file=Brewfile

# ============================================================================
# TERMINAL AND SHELL
# ============================================================================
cask "ghostty"                    # Modern terminal emulator
brew "starship"                   # Two-line MCRN prompt
brew "zsh-autosuggestions"        # Inline command suggestions
brew "zsh-fast-syntax-highlighting"  # Fast syntax highlighting
brew "zsh-completions"            # Additional completions

# ============================================================================
# MODERN CLI STACK
# ============================================================================
brew "bat"                        # Cat with syntax highlighting
brew "btop"                       # Interactive process viewer
brew "direnv"                     # Directory-specific env vars
brew "eza"                        # Modern ls replacement
brew "fd"                         # Fast find replacement
brew "fastfetch"                  # System info display
brew "fzf"                        # Fuzzy finder
brew "git-delta"                  # Syntax-highlighted git diffs
brew "jq"                         # JSON processor
brew "ripgrep"                    # Fast grep replacement
brew "zoxide"                     # Smarter cd command

# ============================================================================
# CORE DEVELOPMENT ACCESS
# ============================================================================
brew "gh"                         # GitHub CLI
brew "git"                        # Version control
brew "mas"                        # Mac App Store automation
cask "1password"                  # Password manager
cask "1password-cli"              # 1Password CLI integration
cask "tailscale-app"              # Mesh VPN

# ============================================================================
# WARP-PARITY SHELL ENHANCEMENTS
# ============================================================================
brew "atuin"                      # Synced shell history TUI (replaces Ctrl+R)
brew "fzf-tab"                    # fzf-powered completion dropdown
brew "yazi"                       # Terminal file manager with image preview
brew "zsh-autopair"               # IDE-like bracket/quote auto-pairing
brew "zsh-you-should-use"         # Alias discovery reminders

# ============================================================================
# ADDITIONAL CLI TOOLS
# ============================================================================
brew "dust"                       # Better du (disk usage)
brew "procs"                      # Modern ps replacement

# ============================================================================
# OPTIONAL UTILITIES
# ============================================================================
# brew "hyperfine"                # Benchmarking tool
# brew "lazygit"                  # Git TUI
# brew "xh"                       # Fast HTTP client
