# Brewfile - 2026 Ready Terminal Stack
# Run: brew bundle install --file=Brewfile

# ============================================================================
# TERMINAL
# ============================================================================
cask "ghostty"                    # Modern, fast terminal emulator (GUI)
brew "fastfetch"                  # System info display (neofetch replacement)
brew "tmux"                       # Terminal multiplexer

# ============================================================================
# MODERN CLI REPLACEMENTS
# ============================================================================
brew "zoxide"                     # Smarter cd command (learns your habits)
brew "eza"                        # Modern ls replacement (icons, git status)
brew "bat"                        # Cat with syntax highlighting
brew "ripgrep"                    # Fast grep replacement
brew "fd"                         # Fast find replacement
brew "btop"                       # Modern top replacement
brew "dust"                       # Better du (disk usage)
brew "fzf"                        # Fuzzy finder
brew "git-delta"                  # Syntax-highlighted git diffs

# ============================================================================
# SHELL ENHANCEMENTS
# ============================================================================
brew "starship"                   # Fast, customizable prompt
brew "zsh-autosuggestions"        # Inline command suggestions
brew "zsh-fast-syntax-highlighting"  # Syntax highlighting (faster alternative)
brew "zsh-completions"            # Additional completions

# ============================================================================
# DEVELOPMENT TOOLS
# ============================================================================
brew "gh"                         # GitHub CLI
brew "git"                        # Version control (latest)
brew "jq"                         # JSON processor (for scripts)
cask "1password-cli"              # 1Password command-line interface (Cask)
brew "direnv"                     # Directory-specific env vars
brew "mise"                       # Global toolchain manager (Node, Python, Go, Java, etc.)
brew "ollama"                     # Optional daemon-based LLM, keeping for flexibility
brew "llama.cpp"                  # llama-cli for real-time LLM ZLE widget

# ============================================================================
# TESTING TOOLS (Dotfiles Gates)
# ============================================================================
brew "bats-core"                  # Functional testing framework for bash
brew "shellcheck"                 # Static analysis for bash scripts
brew "shfmt"                      # Shell script formatter

# ============================================================================
# ADDITIONAL CLI TOOLS (From your installed apps)
# ============================================================================
brew "imagemagick"                # Image manipulation
brew "ffmpeg"                     # Video/audio processing
brew "glances"                    # System monitoring (htop alternative)
brew "htop"                       # Interactive process viewer

# ============================================================================
# OPTIONAL TOOLS (Uncomment if needed)
# ============================================================================
# brew "lazygit"                  # TUI for git
# brew "httpie"                   # Modern curl alternative
# brew "xh"                       # Fast HTTP client
# brew "hyperfine"                # Benchmarking tool
# brew "tokei"                    # Code statistics
# brew "tre-command"              # Tree command replacement
# brew "zellij"                   # Modern tmux alternative (Rust)

# ============================================================================
# CASK APPLICATIONS (GUI apps - Based on your installed apps)
# ============================================================================
# Essential
cask "1password"                  # Password manager
cask "raycast"                    # Spotlight replacement + window management
cask "arc"                        # Modern browser

# Development
cask "zed"                        # High-performance editor
cask "github"                     # GitHub Desktop

# Communication
cask "discord"                    # Chat/community
cask "beeper"                     # Unified messaging

# System & Utilities
cask "bartender"                  # Menu bar management
cask "cleanshot"                  # Screenshot tool
cask "tailscale"                  # VPN/mesh networking

# Media
cask "stolendata-mpv"             # Media player

# Other (Uncomment if needed on new machine)
# cask "chatgpt"                  # AI chat desktop app
# cask "obs"                      # Streaming/recording
# cask "karabiner-elements"       # Keyboard customization
# cask "notion-calendar"          # Calendar app
# cask "docker"                   # Container platform
cask "orbstack"                 # Docker Desktop alternative (lighter)
# cask "microsoft-remote-desktop" # RDP client
cask "google-drive"             # Cloud storage sync
